Public Attributes | List of all members
API_StairTreadQuantity Struct Reference
Element Manager
Calculated values for a stair tread. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | area
Top surface area of the given tread.
 double  | volume
Volume of the given tread.
 double  | thickness
Thickness of the given tread.
 double  | elevation
Elevation to project zero.
 Int32  | stepIndex
Step index of the given tread.
 Int32  | filler
Reserved for later use.
Detailed Description
Calculated values for a stair tread.